# GetExportFontTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..GetExportFontTable Method
BaseExportOptions Class See Also
---
Gets font table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ExportFontTable GetExportFontTable()
```

Visual Basic
---
```text
Public Function GetExportFontTable As ExportFontTable
```

Visual C++
---
```text
public:
ExportFontTable^ GetExportFontTable()
```

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace